fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ДатаНачалаДействия КАК ДатаНачалаДействия,
		|	ДоговорыКонтрагентов.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
		|	ДоговорыКонтрагентов.СтавкаЧаса КАК СтавкаЧаса,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	ДатаНачалаДоговора = Выборка.ДатаНачалаДействия;
	ДатаОкончанияДоговора = Выборка.ДатаОкончанияДействия;		
	СтавкаЧаса = Выборка.СтавкаЧаса;
	ТипДоговора = Выборка.ВидДоговора;
	
	КонецЦикла;
	
	
	Если ВКМ_договор = ТипДоговора И
	ДатаОкончанияДоговора>Дата>ДатаНачалаДоговора Тогда
		
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = ВКМ_Клиент;
			Движение.Договор = ВКМ_договор;
			Движение.КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = СтавкаЧаса * Движение.КоличествоЧасов;
		КонецЦикла;			
	Иначе
		Отказ = Истина;
	КонецЕсли;	

КонецПроцедуры


Процедура ПередЗаписью(Отказ)
    
    
    Если ОбменДанными.Загрузка Тогда
        Возврат;
    КонецЕсли;
    
    ТребуетсяУведомление = Ложь;
    
    Если ЭтоНовый() Тогда
        
        СоздатьЗаписьТелеграм("Новый")
    Иначе
             
        
        СтарыйСпециалист = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_Специалист");
        СтароеВремяНачала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ВремяНачалаРаботПлан");
        СтараяДата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ДатаПроведенияРабот");
        СтароеВремяОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ВКМ_ВремяОкончанияРаботПлан");
       
        Если СтарыйСпециалист <> ВКМ_Специалист Тогда
            СоздатьЗаписьТелеграм("Специалист");
        КонецЕсли;
        
        Если ВКМ_ВремяОкончанияРаботПлан <> СтароеВремяОкончания Тогда
            СоздатьЗаписьТелеграм("ВремяОкончанияРабот");
        КонецЕсли;
        
        
        Если СтароеВремяНачала <> ВКМ_ВремяНачалаРаботПлан Тогда
            СоздатьЗаписьТелеграм("ВремяНачалаРабот");
        КонецЕсли;
        
        
        Если СтараяДата <> ВКМ_ДатаПроведенияРабот Тогда
            СоздатьЗаписьТелеграм("Дата");
        КонецЕсли;
        
    КонецЕсли;
    
    // Если что-то изменилось — создаём запись в справочнике Телеграм
    Если ТребуетсяУведомление Тогда
        
    КонецЕсли;
    
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗаписьТелеграм(Источник)
    
    Если Источник = "ВремяНачалаРабот" Тогда
    	Текст = "Изменено время начала работ в %1";
    ИначеЕсли Источник = "ВремяОкончанияРабот" Тогда
    	Текст = "Изменено время окончания работ в %1";
    ИначеЕсли Источник = "Специалист" Тогда
    	Текст = "Изменен специалист в %1";
    ИначеЕсли Источник = "Новый" Тогда
    	Текст = "Создан новый документ: %1";
    Иначе
    	Текст = "Изменена дата в %1";	
    КонецЕсли;			
    
    НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
    
    НовыйЭлемент.ТекстСообщения = СтрШаблон(Текст, Ссылка);
   
    НовыйЭлемент.Записать();
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
